<H2>Pandas DataFrame</H2>

Make a Pandas DataFrame with two-dimensional list

In [52]:
import pandas as pd

In [53]:
lis=[['smriti',23],['srishti',25]]
data=pd.DataFrame(lis)
print(data)

         0   1
0   smriti  23
1  srishti  25

Python | Creating DataFrame from dict of narray/lists

In [54]:
d={'category':['Fruit','Vegetable','Car'],'Values':['apple','tomato','BMW']}
data1=pd.DataFrame(d)
print(data1)

    category  Values
0      Fruit   apple
1  Vegetable  tomato
2        Car     BMW

Creating Pandas dataframe using list of lists

In [55]:
l=[['fruit','apple'],['vegetable','tomato'],['car','BMW']]
data2=pd.DataFrame(l)
print(data2)

           0       1
0      fruit   apple
1  vegetable  tomato
2        car     BMW

Creating a Pandas dataframe using list of tuples

In [56]:
t=[('fruit','apple','banana'),('vegeatable','tomato','onion'),('car','BMW','Audi')]
data3=pd.DataFrame(t)
print(data3)

            0       1       2
0       fruit   apple  banana
1  vegeatable  tomato   onion
2         car     BMW    Audi

Create a Pandas DataFrame from List of Dicts

In [57]:
dict=[{'fruit':'apple','vegetable':'tomato'},
{'fruit':'banana','vegetable':'onion'}]
data4=pd.DataFrame(dict)
print(data4)

    fruit vegetable
0   apple    tomato
1  banana     onion

Convert list of nested dictionary into Pandas dataframe

In [58]:
d1={'category':{'fruits':'apple','vegetable':'tomato'},'names':{'smriti':23,'srishti':25}}
data5=pd.DataFrame(d1)
print(data5)

          category  names
fruits       apple    NaN
vegetable   tomato    NaN
smriti         NaN   23.0
srishti        NaN   25.0

Replace values in Pandas dataframe using regex

In [59]:
df=pd.DataFrame({'City':['New York', 'Parague', 'New Delhi', 'Venice', 'new Orleans'],
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy', 'Tech_Summit'],
                    'Cost':[10000, 5000, 15000, 2000, 12000]})
index_=[pd.Period('02-2018'), pd.Period('04-2018'),
          pd.Period('06-2018'), pd.Period('10-2018'), pd.Period('12-2018')]
df.index=index_
print(df)

                City        Event   Cost
2018-02     New York        Music  10000
2018-04      Parague       Poetry   5000
2018-06    New Delhi      Theatre  15000
2018-10       Venice       Comedy   2000
2018-12  new Orleans  Tech_Summit  12000

In [60]:
df_updated=df.replace(to_replace='[nN]ew ',value='New_',regex=True)
print(df_updated)

                City        Event   Cost
2018-02     New_York        Music  10000
2018-04      Parague       Poetry   5000
2018-06    New_Delhi      Theatre  15000
2018-10       Venice       Comedy   2000
2018-12  New_Orleans  Tech_Summit  12000

Creating a dataframe from Pandas series

In [61]:
author=['Wes Kinney','Rich and Knight','Silberschatz','Galvin']
s=pd.Series(author)
print(s)

0         Wes Kinney
1    Rich and Knight
2       Silberschatz
3             Galvin
dtype: object

In [70]:
df1=pd.DataFrame(s)
df1.set_axis(['Author'],axis='columns',inplace=True)
print(df1)

            Author
0       Wes Kinney
1  Rich and Knight
2     Silberschatz
3           Galvin

C:\Users\bansa\AppData\Local\Temp\ipykernel_7092\3019407325.py:2: FutureWarning: DataFrame.set_axis 'inplace' keyword is deprecated and will be removed in a future version. Use `obj = obj.set_axis(..., copy=False)` instead
  df1.set_axis(['Author'],axis='columns',inplace=True)

Construct a DataFrame in Pandas using string data

In [73]:
from io import StringIO
sd=StringIO("""Name;Dept;Salary
abc;IT;10000
xyz;Marketing;12000
rst;HR;2000""")
df2=pd.read_csv(sd,sep=";")
print(df2)

  Name       Dept  Salary
0  abc         IT   10000
1  xyz  Marketing   12000
2  rst         HR    2000

Reindexing in Pandas DataFrame

In [82]:
import numpy as np
col=['a','b','c','d']
ind=['A','B','C','D']
df3=pd.DataFrame(np.random.rand(4,4),columns=col,index=ind)
print(df3)

          a         b         c         d
A  0.298734  0.421094  0.884512  0.469426
B  0.202836  0.416533  0.627482  0.054000
C  0.708371  0.336502  0.546217  0.620162
D  0.602635  0.268971  0.242330  0.156395

In [80]:
df3.reindex(['B','C','A','D'])

          a         b         c         d
B  0.066268  0.511731  0.805573  0.556204
C  0.604733  0.099382  0.594740  0.509923
A  0.596213  0.509975  0.986902  0.596656
D  0.073461  0.292532  0.597633  0.716100

In [84]:
df3.reindex(['B','C','A','D'],axis='columns')

    B   C   A   D
A NaN NaN NaN NaN
B NaN NaN NaN NaN
C NaN NaN NaN NaN
D NaN NaN NaN NaN

Mapping external values to dataframe values in Pandas

Using map function

In [85]:
init_d={'Name':['Smriti','Srishti','Aakansha','Tanisha','Lata'],
        'Age':[23,21,24,25,27],
        'City':['Dehradun','Haryana','Punjab','Goa','Bangalore']}
df4=pd.DataFrame(init_d)
print(df4)

       Name  Age       City
0    Smriti   23   Dehradun
1   Srishti   21    Haryana
2  Aakansha   24     Punjab
3   Tanisha   25        Goa
4      Lata   27  Bangalore

In [87]:
new_d={'Smriti':'B.Tech',
        'Srishti':'MBA',
        'Aakansha':'Bcom',
        'Tanisha':'BBA',
        'Lata':'B.Tech'}
df4['Qualification']=df4['Name'].map(new_d)
print(df4)

       Name  Age       City Qualification
0    Smriti   23   Dehradun        B.Tech
1   Srishti   21    Haryana           MBA
2  Aakansha   24     Punjab          Bcom
3   Tanisha   25        Goa           BBA
4      Lata   27  Bangalore        B.Tech

Using replace function

In [92]:
new_r={'Dehradun':'Uttarakhand',
        'Haryana':'Chandigarh'}
df4.replace(new_r,inplace=True)
print(df4)

       Name  Age         City Qualification
0    Smriti   23  Uttarakhand        B.Tech
1   Srishti   21   Chandigarh           MBA
2  Aakansha   24       Punjab          Bcom
3   Tanisha   25          Goa           BBA
4      Lata   27    Bangalore        B.Tech

In [95]:
df4.columns=df4.columns.str.replace('City','Location')
print(df4)

       Name  Age     Location Qualification
0    Smriti   23  Uttarakhand        B.Tech
1   Srishti   21   Chandigarh           MBA
2  Aakansha   24       Punjab          Bcom
3   Tanisha   25          Goa           BBA
4      Lata   27    Bangalore        B.Tech

Reset Index in Pandas Dataframe

In [97]:
d={'Name':['Smriti','Srishti','Aakansha','Tanisha','Lata'],
        'Age':[23,21,24,25,27],
        'City':['Dehradun','Haryana','Punjab','Goa','Bangalore']}
index=['a','b','c','d','e']
df5=pd.DataFrame(d,index)
df5

       Name  Age       City
a    Smriti   23   Dehradun
b   Srishti   21    Haryana
c  Aakansha   24     Punjab
d   Tanisha   25        Goa
e      Lata   27  Bangalore

In [100]:
df5.set_index(df5['Age'],inplace=True)
df5

         Name  Age       City
Age
23     Smriti   23   Dehradun
21    Srishti   21    Haryana
24   Aakansha   24     Punjab
25    Tanisha   25        Goa
27       Lata   27  Bangalore

Change column names and row indexes in Pandas DataFrame

In [107]:
data={'Name':['Peter','Van','Housan'],
        'Age':[25,26,28]}
df6=pd.DataFrame(data)
df6

     Name  Age
0   Peter   25
1     Van   26
2  Housan   28

In [109]:
df6.columns=['Col_1','Col2']
df6.index=['a','b','c']
df6

    Col_1  Col2
a   Peter    25
b     Van    26
c  Housan    28